cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'archey'
brew 'ascii'
brew 'bash'
brew 'cdargs'
brew 'cheat'
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew 'dict'
brew 'direnv'
brew 'fortune'
brew 'haskell-stack'
brew 'gawk'
brew 'git'
brew 'git-credential-manager'
brew 'gnu-tar'
brew 'go'
brew 'grc'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssh'
brew 'openssl'
brew 'make'
brew 'pre-commit'
brew 'python3'
brew 'readline'
brew 'ripgrep'
brew 'roundup'
brew 'rsync'
brew 'rust'
brew 'sl'
brew 'source-highlight'
brew 'spaceman-diff'
brew 'spark'
brew 'sqlite'
brew 'squid'
brew 'todo-txt'
brew 'thes_silver_searcher'
brew 'tmux --with-override-system-vi'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'xonsh'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'keybase'
cask 'gimp'
cask 'google-chrome'
cask 'handbrake'
cask 'haskell-platform'
cask 'inkscape'
cask 'iterm2'
cask 'karabiner-elements'
cask 'macs-fan-control'
cask 'ngrok'
cask 'osxfuse'
cask 'slack'
cask 'torguard'
cask 'transmission'
cask 'vlc'
