cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'archey4'
brew 'ascii'
brew 'asdf'
brew 'autopep8'
brew 'bash'
brew 'cdargs'
brew 'cheat'
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'csvq'
brew 'curl'
brew 'dict'
brew 'direnv'
brew 'flake8'
brew 'fortune'
brew 'fzf'
#brew 'haskell-stack'
brew 'httpie'
brew 'gawk'
brew 'gdrive'
brew 'gettext'
brew 'git'
brew 'gnu-tar'
brew 'go'
brew 'grc'
brew 'grep'
brew 'httpie'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'jesseduffield/lazygit/lazygit'
brew 'jp2a'
brew 'jq'
brew 'isort'
brew 'libcaca'
brew 'libgit2'
brew 'openssh'
brew 'openssl'
brew 'make'
brew 'mypy'
brew 'pandoc'
brew 'parallel'
brew 'pre-commit'
brew 'pylint'
brew 'python3'
brew 'readline'
brew 'ripgrep'
brew 'roundup'
brew 'rsync'
brew 'rustup-init'
brew 'shellcheck'
brew 'sl'
brew 'source-highlight'
brew 'spaceman-diff'
brew 'spark'
brew 'sqlite'
brew 'sqlite3'
brew 'squid'
brew 'tcl-tk'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'xonsh'
brew 'xz'
brew 'youtube-dl'
brew 'yq'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'amethyst'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'geektool'
brew 'git-credential-manager'
#cask 'gimp'
cask 'handbrake'
#cask 'haskell-platform'
#cask 'inkscape'
cask 'iterm2'
cask 'karabiner-elements'
#cask 'little-snitch'
cask 'logseq'
cask 'macfuse'
cask 'macs-fan-control'
#cask 'mailmate'
cask 'ngrok'
#cask 'protonmail-bridge'
cask 'protonvpn'
cask 'signal'
cask 'todoist'
cask 'transmission'
cask 'vlc'
