cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'archey'
brew 'ascii'
brew 'autopep8'
brew 'bash'
brew 'cdargs'
brew 'cheat'
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'csvq'
brew 'curl'
brew 'dict'
brew 'direnv'
brew 'flake8'
brew 'fortune'
#brew 'haskell-stack'
brew 'httpie'
brew 'gawk'
brew 'gdrive'
brew 'gettext'
brew 'git'
brew 'git-credential-manager'
brew 'gnu-tar'
brew 'go'
brew 'grc'
brew 'httpie'
brew 'jp2a'
brew 'jq'
brew 'isort'
brew 'libcaca'
brew 'libgit2'
brew 'openssh'
brew 'openssl'
brew 'make'
brew 'mypy'
brew 'parallel'
brew 'pre-commit'
brew 'pylint'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python3'
brew 'readline'
brew 'ripgrep'
brew 'roundup'
brew 'rsync'
brew 'rust'
brew 'shellcheck'
brew 'sl'
brew 'source-highlight'
brew 'spaceman-diff'
brew 'spark'
brew 'sqlite'
brew 'squid'
brew 'todo-txt'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'xonsh'
brew 'youtube-dl'
brew 'yq'
brew 'zsh'
brew 'zsh-completions'

cask '1password'
cask 'amethyst'
cask 'atom'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'itsycal'
#cask 'keybase'
#cask 'gimp'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'handbrake'
#cask 'haskell-platform'
#cask 'inkscape'
cask 'iterm2'
cask 'karabiner-elements'
cask 'little-snitch'
cask 'macs-fan-control'
cask 'mailmate'
cask 'ngrok'
cask 'osxfuse'
cask 'protonmail-bridge'
cask 'slack'
cask 'torguard'
cask 'transmission'
cask 'vlc'
